---
kind: method
id: M:Autodesk.Revit.UI.DockablePane.PaneIsBuiltIn(Autodesk.Revit.UI.DockablePaneId)
source: html/32ae2a70-3acd-a83c-864c-4e92a3352bbd.htm
---
# Autodesk.Revit.UI.DockablePane.PaneIsBuiltIn Method

Returns true if %id% refers to a built-in Revit dockable pane, rather than one created by an add-in.

## Syntax (C#)
```csharp
public static bool PaneIsBuiltIn(
	DockablePaneId id
)
```

## Parameters
- **id** (`Autodesk.Revit.UI.DockablePaneId`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null